
export var lotteArry = [];
export var macArry = [];
export var kfcArry = [];
export var kingArry = [];
export var totalArry = [];

export var kalArry = [];

export var rankArry = [];

var hamMenu = function(brand, name, price, kal, nat, spicy, newHamburger, img) {
	this.brand = brand;
	this.name = name;
	this.price = price;
	this.kal = kal;
	this.nat = nat;
	this.spicy = spicy;
	this.newHamburger = newHamburger;
	this.img = img;
}

function hamPush(brand, name, price, kal, nat, spicy, newHamburger, img) {
	if (brand == '롯데리아') {
		var lotteHam = new hamMenu(brand, name, price, kal, nat, spicy, newHamburger, img);
		lotteArry.push(lotteHam);
		totalArry.push(lotteHam);	
	} else if (brand == '맥도날드') {
		var mcdonaldsHam = new hamMenu(brand, name, price, kal, nat, spicy, newHamburger, img);
		macArry.push(mcdonaldsHam);
		totalArry.push(mcdonaldsHam);
	} else if (brand == '버거킹') {
		var burgerkingHam = new hamMenu(brand, name, price, kal, nat, spicy, newHamburger, img);
		kingArry.push(burgerkingHam);
		totalArry.push(burgerkingHam);
	}
}

function kalPush(brand, name, price, kal, nat, spicy, newHamburger, img){
	var hamKal = new hamMenu(brand, name, price, kal, nat, spicy, newHamburger, img);
	kalArry.push(hamKal);
}

function rankPush(brand, name, price, kal, nat, spicy, newHamburger, img){
	var rankHam = new hamMenu(brand, name, price, kal, nat, spicy, newHamburger, img);
	rankArry.push(rankHam);
}

// 롯데리아 제품군
hamPush('롯데리아','전주 비빔라이스 버거','6,900원','572','1460','매운맛','신제품','1.png');
hamPush('롯데리아','새우베이컨버거','5,800원','538','870','0단계','신제품','2.png');
hamPush('롯데리아','불고기 베이컨','5,800원','522','840','0단계','신제품','3.png');
hamPush('롯데리아','한우불고기','8,400원','572','797','0단계','','4.png');
hamPush('롯데리아','불고기버거','4,700원','476','778','0단계','','5.png');
hamPush('롯데리아','핫크리스피버거','5,900원','503','929','매운맛','','6.png');
hamPush('롯데리아','새우버거','4,700원','492','810','0단계','','7.png');
hamPush('롯데리아','T-REX','4,700원','475','874','0단계','','8.png');
hamPush('롯데리아','더블리아미라클2','6,700원','520','880','0단계','대체육','9.png');
hamPush('롯데리아','모짜레랄 인 더 버거 베이커','7,400원','699','1020','0단계','','10.png');

// 맥도날드 제품군    
hamPush('맥도날드','쿼터파운더 치즈 BBQ 베이컨','8,200원','719','1434','0단계','','1.png');
hamPush('맥도날드','빅맥','5,500원','582','902','0단계','','2.png');
hamPush('맥도날드','맥크리스피 디럭스 버거','6,800원','600','1296','0단계','신제품','3.png');
hamPush('맥도날드','맥스파이시 상하이버거','5,500원','501','1102','0단계','','4.png');
hamPush('맥도날드','1955 버거','6,400원','572','930','0단계','','5.png');
hamPush('맥도날드','더블불고기버거','4,500원','635','997','0단계','','6.png');
hamPush('맥도날드','불고기버거','3,100원','409','670','0단계','','7.png');
hamPush('맥도날드','슈슈버거','4,700원','409','808','0단계','','8.png');
hamPush('맥도날드','슈비버거','5,800원','540','1001','0단계','','9.png');
hamPush('맥도날드','베이컨 토마토 디럭스','5,800원','570','933','0단계','','10.png');

// 버거킹 제품군
hamPush('버거킹','오리지널스 솔티드에그 싱글','9,900원','825','1126','매운맛','신제품','1.png');
hamPush('버거킹','오리지널스 솔티드에그 더블','9,900원','1105','1320','매운맛','신제품','2.png');
hamPush('버거킹','콰트로치즈 큐브스테이크 와퍼','9,900원','882','1480','0단계','신제품','3.png');
hamPush('버거킹','스파이시 큐브 스테이크 와퍼','9,900원','789','1482','매운맛','신제품','4.png');
hamPush('버거킹','통새우와퍼','11,300원','699','1192','매운맛','','5.png');
hamPush('버거킹','불고기와퍼','8,000원','690','886','0단계','','6.png');
hamPush('버거킹','치즈와퍼','8,600원','716','1288','0단계','','7.png');
hamPush('버거킹','통새우슈림프버거','6,900원','459','938','0단계','','8.png');
hamPush('버거킹','치킨버거','4,600원','538','851','0단계','','9.png');
hamPush('버거킹','블랙바비큐콰트로치즈와퍼','10,200원','888','1421','0단계','','10.png');

// 칼로리순 정렬
kalPush('맥도날드','불고기버거','3,100원','409','670','0단계','','7.png');
kalPush('맥도날드','슈슈버거','4,700원','409','808','0단계','','8.png');
kalPush('버거킹','통새우슈림프버거','6,900원','459','938','0단계','','8.png');
kalPush('롯데리아','T-REX','4,700원','475','874','0단계','','8.png');
kalPush('롯데리아','불고기버거','4,700원','476','778','0단계','','5.png');
kalPush('롯데리아','새우버거','4,700원','492','810','0단계','','7.png');
kalPush('맥도날드','맥스파이시 상하이버거','5,500원','501','1102','0단계','','4.png');
kalPush('롯데리아','핫크리스피버거','5,900원','503','929','매운맛','','6.png');
kalPush('롯데리아','더블리아미라클2','6,700원','520','880','0단계','대체육','9.png');
kalPush('롯데리아','불고기 베이컨','5,800원','522','840','0단계','신제품','3.png');
kalPush('롯데리아','새우베이컨버거','5,800원','538','870','0단계','신제품','2.png');
kalPush('버거킹','치킨버거','4,600원','538','851','0단계','','9.png');
kalPush('맥도날드','슈비버거','5,800원','540','1001','0단계','','9.png');
kalPush('맥도날드','베이컨 토마토 디럭스','5,800원','570','933','0단계','','10.png');
kalPush('롯데리아','전주 비빔라이스 버거','6,900원','572','1460','매운맛','신제품','1.png');
kalPush('롯데리아','한우불고기','8,400원','572','797','0단계','','4.png');
kalPush('맥도날드','1955 버거','6,400원','572','930','0단계','','5.png');
kalPush('맥도날드','빅맥','5,500원','582','902','0단계','','2.png');
kalPush('맥도날드','맥크리스피 디럭스 버거','6,800원','600','1296','0단계','신제품','3.png');
kalPush('맥도날드','더블불고기버거','4,500원','635','997','0단계','','6.png');
kalPush('버거킹','불고기와퍼','8,000원','690','886','0단계','','6.png');
kalPush('롯데리아','모짜레랄 인 더 버거 베이커','7,400원','699','1020','0단계','','10.png');
kalPush('버거킹','통새우와퍼','11,300원','699','1192','매운맛','','5.png');
kalPush('버거킹','치즈와퍼','8,600원','716','1288','0단계','','7.png');
kalPush('맥도날드','쿼터파운더 치즈 BBQ 베이컨','8,200원','719','1434','0단계','','1.png');
kalPush('버거킹','스파이시 큐브 스테이크 와퍼','9,900원','789','1482','매운맛','신제품','4.png');
kalPush('버거킹','오리지널스 솔티드에그 싱글','9,900원','825','1126','매운맛','신제품','1.png');
kalPush('버거킹','콰트로치즈 큐브스테이크 와퍼','9,900원','882','1480','0단계','신제품','3.png');
kalPush('버거킹','블랙바비큐콰트로치즈와퍼','10,200원','888','1421','0단계','','10.png');
kalPush('버거킹','오리지널스 솔티드에그 더블','9,900원','1105','1320','매운맛','신제품','2.png');


// 랭킹 순 정렬
rankPush('맥도날드','맥스파이시 상하이버거','5,500원','501','1102','0단계','','4.png');
rankPush('롯데리아','T-REX','4,700원','475','874','0단계','','8.png');
rankPush('버거킹','통새우와퍼','11,300원','699','1192','매운맛','','5.png');
rankPush('롯데리아','불고기 베이컨','5,800원','522','840','0단계','신제품','3.png');
rankPush('버거킹','오리지널스 솔티드에그 더블','9,900원','1105','1320','매운맛','신제품','2.png');
rankPush('맥도날드','슈비버거','5,800원','540','1001','0단계','','9.png');
rankPush('롯데리아','모짜레랄 인 더 버거 베이커','7,400원','699','1020','0단계','','10.png');
rankPush('맥도날드','불고기버거','3,100원','409','670','0단계','','7.png');
rankPush('버거킹','오리지널스 솔티드에그 싱글','9,900원','825','1126','매운맛','신제품','1.png');
rankPush('버거킹','치킨버거','4,600원','538','851','0단계','','9.png');
rankPush('맥도날드','쿼터파운더 치즈 BBQ 베이컨','8,200원','719','1434','0단계','','1.png');
rankPush('롯데리아','불고기버거','4,700원','476','778','0단계','','5.png');
rankPush('롯데리아','전주 비빔라이스 버거','6,900원','572','1460','매운맛','신제품','1.png');
rankPush('맥도날드','빅맥','5,500원','582','902','0단계','','2.png');
rankPush('맥도날드','맥크리스피 디럭스 버거','6,800원','600','1296','0단계','신제품','3.png');
rankPush('맥도날드','베이컨 토마토 디럭스','5,800원','570','933','0단계','','10.png');
rankPush('맥도날드','더블불고기버거','4,500원','635','997','0단계','','6.png');
rankPush('롯데리아','더블리아미라클2','6,700원','520','880','0단계','대체육','9.png');
rankPush('롯데리아','핫크리스피버거','5,900원','503','929','매운맛','','6.png');
rankPush('맥도날드','슈슈버거','4,700원','409','808','0단계','','8.png');
rankPush('버거킹','스파이시 큐브 스테이크 와퍼','9,900원','789','1482','매운맛','신제품','4.png');
rankPush('버거킹','치즈와퍼','8,600원','716','1288','0단계','','7.png');
rankPush('버거킹','통새우슈림프버거','6,900원','459','938','0단계','','8.png');
rankPush('버거킹','블랙바비큐콰트로치즈와퍼','10,200원','888','1421','0단계','','10.png');
rankPush('버거킹','콰트로치즈 큐브스테이크 와퍼','9,900원','882','1480','0단계','신제품','3.png');
rankPush('롯데리아','새우베이컨버거','5,800원','538','870','0단계','신제품','2.png');
rankPush('롯데리아','한우불고기','8,400원','572','797','0단계','','4.png');
rankPush('롯데리아','새우버거','4,700원','492','810','0단계','','7.png');
rankPush('맥도날드','1955 버거','6,400원','572','930','0단계','','5.png');
rankPush('버거킹','불고기와퍼','8,000원','690','886','0단계','','6.png');


